IDEA StatiCa Open Model
Element1D.RotationRx Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Rotation of Cross-section of Element1D. Difference from default Line LCS
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double RotationRx { get; set; }
Public Property RotationRx As Double
	Get
	Set
public:
property double RotationRx {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
Element1D Class
IdeaRS.OpenModel.Model Namespace